## 955148791056: ConfigRules
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 8 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cbs_s3_access_logs_rule will be created
  + resource "aws_cloudwatch_log_group" "cbs_s3_access_logs_rule" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/CbsS3AccessLogsRule"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
    }

  # aws_config_config_rule.cbs_s3_bucket_logging_enabled will be updated in-place
  ~ resource "aws_config_config_rule" "cbs_s3_bucket_logging_enabled" {
        id               = "cbs_s3_bucket_logging_enabled"
        name             = "cbs_s3_bucket_logging_enabled"
        tags             = {}
        # (5 unchanged attributes hidden)


      ~ source {
          ~ owner             = "AWS" -> "CUSTOM_LAMBDA"
          ~ source_identifier = "S3_BUCKET_LOGGING_ENABLED" -> (known after apply)

          + source_detail {
              + event_source                = "aws.config"
              + maximum_execution_frequency = "TwentyFour_Hours"
              + message_type                = "ScheduledNotification"
            }
        }
        # (1 unchanged block hidden)
    }

  # aws_config_remediation_configuration.cbs_s3_bucket_logging_enabled will be created
  + resource "aws_config_remediation_configuration" "cbs_s3_bucket_logging_enabled" {
      + arn                        = (known after apply)
      + automatic                  = true
      + config_rule_name           = "cbs_s3_bucket_logging_enabled"
      + id                         = (known after apply)
      + maximum_automatic_attempts = 10
      + resource_type              = "AWS::S3::Bucket"
      + retry_attempt_seconds      = 3600
      + target_id                  = "AWS-ConfigureS3BucketLogging"
      + target_type                = "SSM_DOCUMENT"
      + target_version             = "1"

      + execution_controls {
          + ssm_controls {
              + concurrent_execution_rate_percentage = 25
              + error_percentage                     = 20
            }
        }

      + parameter {
          + name         = "AutomationAssumeRole"
          + static_value = "arn:aws:iam::955148791056:role/CbsConfigPolicy"
        }
      + parameter {
          + name           = "BucketName"
          + resource_value = "RESOURCE_ID"
        }
      + parameter {
          + name         = "GrantedPermission"
          + static_value = "FULL_CONTROL"
        }
      + parameter {
          + name         = "GranteeType"
          + static_value = "Group"
        }
      + parameter {
          + name         = "GranteeUri"
          + static_value = "http://acs.amazonaws.com/groups/s3/LogDelivery"
        }
      + parameter {
          + name         = "TargetBucket"
          + static_value = "cbs-satellite-955148791056"
        }
    }

  # aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "IAM policy for listing all S3 buckets and their logging configuration"
      + id          = (known after apply)
      + name        = "CbsS3AccessLogsPolicy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:GetReplicationConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.cbs_s3_access_logs_rule will be created
  + resource "aws_iam_role" "cbs_s3_access_logs_rule" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CbsS3AccessLogsRule"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cbs_s3_access_logs_rule_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_access_logs_rule_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "CbsS3AccessLogsRule"
    }

  # aws_iam_role_policy_attachment.cbs_s3_access_logs_rule_policy will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_access_logs_rule_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "CbsS3AccessLogsRule"
    }

  # aws_lambda_function.cbs_s3_access_logs_rule will be created
  + resource "aws_lambda_function" "cbs_s3_access_logs_rule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/cbs_s3_access_logs_rule.zip"
      + function_name                  = "CbsS3AccessLogsRule"
      + handler                        = "s3_access_logs_rule.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "+S7p2FYpNKi6JebiJWyM8EC5CR7s8rBLJ9DK4JYL/bo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cbs-955148791056"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.cbs_s3_access_logs_rule will be created
  + resource "aws_lambda_permission" "cbs_s3_access_logs_rule" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "config.amazonaws.com"
      + statement_id  = "AllowExecutionFromConfig"
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_bucket_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_satellite_bucket_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_wafv2_logs_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.aws_config_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.security_config"]

13 tests, 8 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
